IvanOrfanidi/SVD_Files/ST/STM32L4x7.svd
        <register>
          <name>LUT80H</name>
          <displayName>LUT80H</displayName>
          <description>Graphic MMU LUT entry 80 high</description>
          <addressOffset>0x1284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT81H</name>
          <displayName>LUT81H</displayName>
          <description>Graphic MMU LUT entry 81 high</description>
          <addressOffset>0x128C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT82H</name>
          <displayName>LUT82H</displayName>
          <description>Graphic MMU LUT entry 82 high</description>
          <addressOffset>0x1294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT83H</name>
          <displayName>LUT83H</displayName>
          <description>Graphic MMU LUT entry 83 high</description>
          <addressOffset>0x129C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT84H</name>
          <displayName>LUT84H</displayName>
          <description>Graphic MMU LUT entry 84 high</description>
          <addressOffset>0x12A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT85H</name>
          <displayName>LUT85H</displayName>
          <description>Graphic MMU LUT entry 85 high</description>
          <addressOffset>0x12AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT86H</name>
          <displayName>LUT86H</displayName>
          <description>Graphic MMU LUT entry 86 high</description>
          <addressOffset>0x12B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT87H</name>
          <displayName>LUT87H</displayName>
          <description>Graphic MMU LUT entry 87 high</description>
          <addressOffset>0x12BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT88H</name>
          <displayName>LUT88H</displayName>
          <description>Graphic MMU LUT entry 88 high</description>
          <addressOffset>0x12C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT89H</name>
          <displayName>LUT89H</displayName>
          <description>Graphic MMU LUT entry 89 high</description>
          <addressOffset>0x12CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT90H</name>
          <displayName>LUT90H</displayName>
          <description>Graphic MMU LUT entry 90 high</description>
          <addressOffset>0x12D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT91H</name>
          <displayName>LUT91H</displayName>
          <description>Graphic MMU LUT entry 91 high</description>
          <addressOffset>0x12DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT92H</name>
          <displayName>LUT92H</displayName>
          <description>Graphic MMU LUT entry 92 high</description>
          <addressOffset>0x12E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT93H</name>
          <displayName>LUT93H</displayName>
          <description>Graphic MMU LUT entry 93 high</description>
          <addressOffset>0x12EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT94H</name>
          <displayName>LUT94H</displayName>
          <description>Graphic MMU LUT entry 94 high</description>
          <addressOffset>0x12F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT95H</name>
          <displayName>LUT95H</displayName>
          <description>Graphic MMU LUT entry 95 high</description>
          <addressOffset>0x12FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT96H</name>
          <displayName>LUT96H</displayName>
          <description>Graphic MMU LUT entry 96 high</description>
          <addressOffset>0x1304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT97H</name>
          <displayName>LUT97H</displayName>
          <description>Graphic MMU LUT entry 97 high</description>
          <addressOffset>0x130C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT98H</name>
          <displayName>LUT98H</displayName>
          <description>Graphic MMU LUT entry 98 high</description>
          <addressOffset>0x1314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT99H</name>
          <displayName>LUT99H</displayName>
          <description>Graphic MMU LUT entry 99 high</description>
          <addressOffset>0x131C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT100H</name>
          <displayName>LUT100H</displayName>
          <description>Graphic MMU LUT entry 100 high</description>
          <addressOffset>0x1324</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT101H</name>
          <displayName>LUT101H</displayName>
          <description>Graphic MMU LUT entry 101 high</description>
          <addressOffset>0x132C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT102H</name>
          <displayName>LUT102H</displayName>
          <description>Graphic MMU LUT entry 102 high</description>
          <addressOffset>0x1334</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT103H</name>
          <displayName>LUT103H</displayName>
          <description>Graphic MMU LUT entry 103 high</description>
          <addressOffset>0x133C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT104H</name>
          <displayName>LUT104H</displayName>
          <description>Graphic MMU LUT entry 104 high</description>
          <addressOffset>0x1344</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT105H</name>
          <displayName>LUT105H</displayName>
          <description>Graphic MMU LUT entry 105 high</description>
          <addressOffset>0x134C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT106H</name>
          <displayName>LUT106H</displayName>
          <description>Graphic MMU LUT entry 106 high</description>
          <addressOffset>0x1354</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT107H</name>
          <displayName>LUT107H</displayName>
          <description>Graphic MMU LUT entry 107 high</description>
          <addressOffset>0x135C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT108H</name>
          <displayName>LUT108H</displayName>
          <description>Graphic MMU LUT entry 108 high</description>
          <addressOffset>0x1364</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT109H</name>
          <displayName>LUT109H</displayName>
          <description>Graphic MMU LUT entry 109 high</description>
          <addressOffset>0x136C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT110H</name>
          <displayName>LUT110H</displayName>
          <description>Graphic MMU LUT entry 110 high</description>
          <addressOffset>0x1374</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT111H</name>
          <displayName>LUT111H</displayName>
          <description>Graphic MMU LUT entry 111 high</description>
          <addressOffset>0x137C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT112H</name>
          <displayName>LUT112H</displayName>
          <description>Graphic MMU LUT entry 112 high</description>
          <addressOffset>0x1384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT113H</name>
          <displayName>LUT113H</displayName>
          <description>Graphic MMU LUT entry 113 high</description>
          <addressOffset>0x138C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT114H</name>
          <displayName>LUT114H</displayName>
          <description>Graphic MMU LUT entry 114 high</description>
          <addressOffset>0x1394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT115H</name>
          <displayName>LUT115H</displayName>
          <description>Graphic MMU LUT entry 115 high</description>
          <addressOffset>0x139C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT116H</name>
          <displayName>LUT116H</displayName>
          <description>Graphic MMU LUT entry 116 high</description>
          <addressOffset>0x13A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT117H</name>
          <displayName>LUT117H</displayName>
          <description>Graphic MMU LUT entry 117 high</description>
          <addressOffset>0x13AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT118H</name>
          <displayName>LUT118H</displayName>
          <description>Graphic MMU LUT entry 118 high</description>
          <addressOffset>0x13B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT119H</name>
          <displayName>LUT119H</displayName>
          <description>Graphic MMU LUT entry 119 high</description>
          <addressOffset>0x13BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
